IDEA Open Model
TendonBarType Enumeration
Compatible with IDEA StatiCa v 10.1
 Tendon bar type
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public enum TendonBarType
Public Enumeration TendonBarType
public enum class TendonBarType
Members
Member name | Value | Description
Posttensioned | 0 |  Post-tensioned
Pretensioned | 1 |  Pre-tensioned
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace